soap/soap-transaction-service/docs/example-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:tran="http://fhtechnikum-wien.at/transactions">
    <soapenv:Header/>
    <soapenv:Body>
        <tran:StoreTransactionRequest xmlns:tran="http://fhtechnikum-wien.at/transactions">
            <id>1</id>
            <name>max</name>
            <timestamp>2025-01-01T12:00:00Z</timestamp>
            <amount>100.50</amount>
        </tran:StoreTransactionRequest>
    </soapenv:Body>
</soapenv:Envelope>